                                        
                                 PrimeTime (R)
                                        
              Version K-2015.06-SP3-2 for linux64 - Apr 07, 2016 
                                        
                    Copyright (c) 1988 - 2016 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
            or distribution of this software is strictly prohibited.

set library_name NangateOpenCellLibrary
NangateOpenCellLibrary
set link_library [list * nangate_scan.db]
* nangate_scan.db
set top_module $::env(top)
divider_dshift
read_verilog ./gate/${top_module}/${top_module}_scan.v
1
#ungroup -flatten -all
# Define top level in the hierarchy
current_design $top_module
Loading verilog file '/winhomes/oar5/project/gate/divider_dshift/divider_dshift_scan.v'
Loading db file '/winhomes/oar5/project/nangate_scan.db'
{"divider_dshift"}
link_design 
Linking design divider_dshift...
Information: 100 (74.63%) library cells are unused in library nangate_scan..... (LNK-045)
Information: total 100 library cells are unused (LNK-046)
Design 'divider_dshift' was successfully linked.
Information: There are 2296 leaf cells, ports, hiers and 2588 nets in the design (LNK-047)
1
# SET CONSTRAINTS
set_max_area 0
1
#Clock setup commands
set CLK_PERIOD $::env(CLK_PERIOD)
1
#set DFF_CKQ 0.02
#set SETUP_TIME 0.01
set CLK $::env(clk) 
i_clk
create_clock -period $CLK_PERIOD [get_ports $CLK]
1
set_clock_transition -rise 0.05 [get_clocks $CLK]
1
set_clock_transition -fall 0.03 [get_clocks $CLK]
1
set_clock_latency -rise 0.01 [get_clocks $CLK]
1
set_clock_latency -fall 0.03 [get_clocks $CLK]
1
set_ideal_network [get_ports $CLK]
1
#set_propagated_clock [all_clocks]
#set_clock_uncertainty 0.2 [all_clocks]
read_sdf compilation/${top_module}.sdf
Information: Merging of parallel arcs is disabled by read_sdf. (SDF-040)

Timing updates: 0 (0 implicit, 0 explicit) (0 incremental, 0 full, 0 logical)
Noise updates: 0 (0 implicit, 0 explicit) (0 incremental, 0 full)
Maximum memory usage for this session: 563.16 MB
CPU usage for this session: 1 seconds 
Elapsed time for this session: 484 seconds
